function buildWall(arr) {
    let arrNum = arr.map(Number);
    let concreteDay = [];
    let totalConcrete = 0;
    let costs = 0;
    let crews = arrNum.filter(len => len < 30).length; // let crews = arrNum.length;
    while (crews !== 0) {
        let concreteByAllCrews = 0;
        for (let i = 0; i < arrNum.length; i++) {
            if (arrNum[i] !== 30) {
                arrNum[i]++;
                concreteByAllCrews += 195;
                if (arrNum[i] == 30) {
                    crews--;
                }
            }
        }
        totalConcrete += concreteByAllCrews;
        concreteDay.push(concreteByAllCrews);
    }
    costs = totalConcrete * 1900;
    console.log(concreteDay.join(", "));
    console.log(`${costs} pesos`); 
}
buildWall([21, 25, 28]);
/*Напишете програма, която следи конструкцията на стена от 30 фута.>> 1 ярд = 3 фут [ft]
Ще ви бъде даден масив, представляващи първоначалната височина участъци от стената, във футове. 
Всяка секция има свой строителен екип, който може да добави 1 фут височина на ден, 
като използва 195 кубически ярда бетон. 
Всички екипи работят едновременно (вижте примерите), 
което означава,че всички секции, които не са завършени<30 фута, растат с 1 фут на ден. 
Когато част от стената е завършена, нейният екип спира.
Вашата програма трябва да следи колко бетон се използва ежедневно до завършването на цялата стена. 
Накрая отпечатайте на един ред, разделени със запетая и интервал, количеството бетон, използвано всеки ден, 
а на втори ред крайната цена на стената. Един кубичен ярд бетон струва 1900 песо.

Ограничения
• Стената може да съдържа до 2000 секции (2000 елемента в първоначалния масив)
• Началната височина за всяка секция е в диапазона [0…30]

Обяснение
През първия ден и трите екипажа работят, като всеки добавя по 1 фут към своята секция, 
общо 585 кубични ярда (3 x 195). 
На втория ден е същото, като последният участък достига 30 фута и неговият екип спира 
(маркирани в червено, докато не работят). 
На третия ден работят само два екипажа, които използват общо 390 кубически метра. 
Това продължава още 2 дни, като вторият участък достига 30 фута. 
В останалите 4 дни работи само 1 бригада, която използва 195 кубика всеки ден. 
През целия период са използвани 3120 кубични ярда бетон, струващи 5'928'000 песо. 
И това беше само за 3 мили, представете си 2000!*/